zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_dcmipp.c
    if (pParallelConfig->SynchroMode == DCMIPP_SYNCHRO_EMBEDDED)
    {
      /* Set Embedded Sync codes */
      prescr_reg = (((uint32_t)pParallelConfig->SynchroCodes.FrameEndCode << DCMIPP_PRESCR_FEC_Pos)   | \
                    ((uint32_t)pParallelConfig->SynchroCodes.LineEndCode << DCMIPP_PRESCR_LEC_Pos)    | \
                    ((uint32_t)pParallelConfig->SynchroCodes.FrameStartCode << DCMIPP_PRESCR_FSC_Pos) | \
                    ((uint32_t)pParallelConfig->SynchroCodes.LineStartCode << DCMIPP_PRESCR_LSC_Pos));

      WRITE_REG(phdcmipp->Instance->PRESCR, prescr_reg);

      /* Set Embedded Sync Unmask codes : All codes are unmasked */
      WRITE_REG(phdcmipp->Instance->PRESUR, 0xFFFFFFFFU);
    }

    /* Enable the Synchronization error interrupt on parallel interface */
    __HAL_DCMIPP_ENABLE_IT(phdcmipp, DCMIPP_IT_PARALLEL_SYNC_ERROR);

    /* Enable Parallel interface enable */
    phdcmipp->Instance->PRCR |= DCMIPP_PRCR_ENABLE;
  }

  /* Update the DCMIPP state */
  phdcmipp->State = HAL_DCMIPP_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Configure pipe
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure that contains
  *               the configuration information for the DCMIPP.
  * @param  pPipeConfig pointer to pipe configuration structure
  * @param  Pipe  pipe to be configured
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Config(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe,
                                         const DCMIPP_PipeConfTypeDef *pPipeConfig)
{
  HAL_DCMIPP_PipeStateTypeDef pipe_state;

  /* Check the DCMIPP peripheral handle parameter and pPipeConfig parameter*/
  if ((phdcmipp == NULL) || (pPipeConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(phdcmipp->Instance));
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_FRAME_RATE(pPipeConfig->FrameRate));
  /* Get Pipe State */
  pipe_state = phdcmipp->PipeState[Pipe];

  if (phdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if ((pipe_state == HAL_DCMIPP_PIPE_STATE_RESET) || \
        (pipe_state == HAL_DCMIPP_PIPE_STATE_ERROR))
    {
      /* Update the DCMIPP PIPE state */
      phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_BUSY;

      /* Initialize the DCMIPP Pipe registers */
      Pipe_Config(phdcmipp, Pipe, pPipeConfig);

      /* Update the DCMIPP pipe state */
      phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_READY;
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Configure the DCMIPP AXI master memory IP-Plug.
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure
  * @param  pIPPlugConfig pointer to IPPLUG configuration structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_SetIPPlugConfig(DCMIPP_HandleTypeDef *phdcmipp,
                                             const DCMIPP_IPPlugConfTypeDef *pIPPlugConfig)
{
  uint32_t timeout = HAL_GetTick();

  /* Check handle validity */
  if ((phdcmipp == NULL) || (pIPPlugConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DCMIPP_CLIENT(pIPPlugConfig->Client));
  assert_param(IS_DCMIPP_DPREG_END(pIPPlugConfig->DPREGEnd));
  assert_param(IS_DCMIPP_DPREG_START(pIPPlugConfig->DPREGStart));
  assert_param(IS_DCMIPP_MAX_OUTSTANDING_TRANSACTIONS(pIPPlugConfig->MaxOutstandingTransactions));
  assert_param(IS_DCMIPP_MEMORY_PAGE_SIZE(pIPPlugConfig->MemoryPageSize));
  assert_param(IS_DCMIPP_TRAFFIC(pIPPlugConfig->Traffic));
  assert_param(IS_DCMIPP_WLRU_RATIO(pIPPlugConfig->WLRURatio));


  if (phdcmipp->State != HAL_DCMIPP_STATE_RESET)
  {
    /* IP-PLUG Client1 configuration */
    if (pIPPlugConfig->Client == DCMIPP_CLIENT1)
    {
      /* Request to lock the IP-Plug, to allow reconfiguration */
      SET_BIT(phdcmipp->Instance->IPGR2, DCMIPP_IPGR2_PSTART);

      do
      {
        timeout--;
        if (timeout == 0U)
        {
          return HAL_ERROR;
        }
      } while ((phdcmipp->Instance->IPGR3 & DCMIPP_IPGR3_IDLE_Msk) != DCMIPP_IPGR3_IDLE);
      /* IP-Plug is currently locked and can be reconfigured */

      /* Set Memory page size */
      phdcmipp->Instance->IPGR1 = (pIPPlugConfig->MemoryPageSize);

      /* Set Traffic : Burst size and Maximum Outstanding transactions */
      phdcmipp->Instance->IPC1R1 = ((uint32_t)pIPPlugConfig->Traffic |
                                    ((uint32_t)pIPPlugConfig->MaxOutstandingTransactions));

      /* Set End word and Start Word of the FIFO of the Clientx */
      phdcmipp->Instance->IPC1R3 = (((uint32_t)pIPPlugConfig->DPREGStart << DCMIPP_IPC1R3_DPREGSTART_Pos) |
                                    ((uint32_t)pIPPlugConfig->DPREGEnd << DCMIPP_IPC1R3_DPREGEND_Pos));
      /* Set End word and Start Word of the FIFO of the Clientx */
      phdcmipp->Instance->IPC1R2 = ((uint32_t)pIPPlugConfig->WLRURatio << DCMIPP_IPC1R2_WLRU_Pos);

      /* No lock requested, IP-Plug runs on demand by background HW */
      CLEAR_BIT(phdcmipp->Instance->IPGR2, DCMIPP_IPGR2_PSTART);

      /* Enable DCMIPP_IT_AXI_TRANSFER_ERR */
      __HAL_DCMIPP_ENABLE_IT(phdcmipp, DCMIPP_IT_AXI_TRANSFER_ERROR);
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup DCMIPP_Exported_Functions_Group3 IO operation functions
  *  @brief   I/O operation functions
  * @{
  */
/**
  * @brief  Enables DCMIPP capture on the specified pipe
  * @param  phdcmipp    Pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe  pipe to be started
  * @param  DstAddress the destination address
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Start(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe, uint32_t DstAddress,
                                        uint32_t CaptureMode)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if (phdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check DCMIPP pipe state */
  if (phdcmipp->PipeState[Pipe]  != HAL_DCMIPP_PIPE_STATE_READY)
  {
    return HAL_ERROR;
  }

  /* Update the DCMIPP pipe State */
  phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_BUSY;

  if (Pipe == DCMIPP_PIPE0)
  {
    /* Set the capture mode */
    phdcmipp->Instance->P0FCTCR |= CaptureMode;

    /* Set the destination address */
    WRITE_REG(phdcmipp->Instance->P0PPM0AR1, DstAddress);

