zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_dcmipp.c
    /* Enable all required interrupts lines for the PIPE0 */
    __HAL_DCMIPP_ENABLE_IT(phdcmipp, DCMIPP_IT_PIPE0_FRAME | DCMIPP_IT_PIPE0_VSYNC | DCMIPP_IT_PIPE0_OVR);

    /* Activate the Pipe */
    SET_BIT(phdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_PIPEN);

    /* Start the capture */
    SET_BIT(phdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_CPTREQ);

  }
  else
  {
    /* Update the DCMIPP pipe State */
    phdcmipp->PipeState[DCMIPP_PIPE0] = HAL_DCMIPP_PIPE_STATE_READY;

    return HAL_ERROR;
  }

  return HAL_OK;
}


/**
  * @brief  Enables DCMIPP capture on the specified pipe with double buffering Mode Enabled
  * @param  phdcmipp    Pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe  pipe to be started
  * @param  DstAddress0 the first destination address
  * @param  DstAddress1 the second destination address
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DoubleBufferStart(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe, uint32_t DstAddress0,
                                                    uint32_t DstAddress1, uint32_t CaptureMode)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if (phdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check DCMIPP pipe state */
  if (phdcmipp->PipeState[Pipe]  != HAL_DCMIPP_PIPE_STATE_READY)
  {
    return HAL_ERROR;
  }

  /* Update the DCMIPP pipe State */
  phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_BUSY;

  if (Pipe == DCMIPP_PIPE0)
  {
    /* Set the capture mode */
    phdcmipp->Instance->P0FCTCR |= CaptureMode;

    /* Set the destination address */
    WRITE_REG(phdcmipp->Instance->P0PPM0AR1, DstAddress0);

    /* Set the second destination address */
    WRITE_REG(phdcmipp->Instance->P0PPM0AR2, DstAddress1);

    /* Enable Double buffering Mode */
    SET_BIT(phdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_DBM);

    /* Enable all required interrupts lines for the Pipe0 */
    __HAL_DCMIPP_ENABLE_IT(phdcmipp, DCMIPP_IT_PIPE0_FRAME | DCMIPP_IT_PIPE0_VSYNC | DCMIPP_IT_PIPE0_OVR);

    /* Activate the Pipe */
    SET_BIT(phdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_PIPEN);

    /* Start the capture */
    SET_BIT(phdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_CPTREQ);
  }
  else
  {
    /* Update the DCMIPP pipe State */
    phdcmipp->PipeState[0] = HAL_DCMIPP_PIPE_STATE_READY;

    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Stop DCMIPP capture on the specified pipe
  * @param  phdcmipp    Pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe    Pipe to be stopped
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Stop(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  uint32_t timeout = HAL_GetTick();
  HAL_DCMIPP_PipeStateTypeDef pipe_state;

  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if (phdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Get Pipe State */
  pipe_state = phdcmipp->PipeState[Pipe];
  /* Check DCMIPP Pipe state */
  if ((pipe_state == HAL_DCMIPP_PIPE_STATE_BUSY) || \
      (pipe_state == HAL_DCMIPP_PIPE_STATE_READY) || \
      (pipe_state == HAL_DCMIPP_PIPE_STATE_ERROR))
  {
    if (Pipe == DCMIPP_PIPE0)
    {
      /* Stop the capture */
      CLEAR_BIT(phdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_CPTREQ);

      /* Check that the Capture Request is effectively stopped */
      do
      {
        timeout--;
        if (timeout == 0U)
        {
          return HAL_ERROR;
        }
      } while ((phdcmipp->Instance->P0FCTCR & DCMIPP_P0FCTCR_CPTREQ) != 0U);

      /* Disable DBM when enabled */
      if ((phdcmipp->Instance->P0PPCR & DCMIPP_P0PPCR_DBM) == DCMIPP_P0PPCR_DBM)
      {
        CLEAR_BIT(phdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_DBM);
      }

      /* Disable the pipe */
      CLEAR_BIT(phdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_PIPEN);

      /* Disable all interrupts for this pipe */
      __HAL_DCMIPP_DISABLE_IT(phdcmipp, DCMIPP_IT_PIPE0_FRAME | DCMIPP_IT_PIPE0_VSYNC | DCMIPP_IT_PIPE0_LINE | \
                              DCMIPP_IT_PIPE0_LIMIT | DCMIPP_IT_PIPE0_OVR);

    }
    else
    {
      return HAL_ERROR;
    }

    /* Update DCMIPP Pipe State */
    phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_READY;
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Suspend DCMIPP Pipe capture
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe Pipe to be suspended
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Suspend(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  uint32_t timeout = HAL_GetTick();

  if (phdcmipp == NULL)
  {
    /* Return Function Status */
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE0)
  {
    /* Check Pipe0 State */
    if (phdcmipp->PipeState[0] == HAL_DCMIPP_PIPE_STATE_BUSY)
    {
      /* Disable Capture Request */
      phdcmipp->Instance->P0FCTCR &= ~DCMIPP_P0FCTCR_CPTREQ;
      /* Change Pipe State */
      phdcmipp->PipeState[0] = HAL_DCMIPP_PIPE_STATE_SUSPEND;

      /* Check if the DCMIPP capture effectively disabled */
      do
      {
        timeout-- ;
        if (timeout == 0U)
        {
          /* Change Pipe State */
          phdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_ERROR;

          return HAL_ERROR;
        }
      } while ((phdcmipp->Instance->P0FCTCR & DCMIPP_P0FCTCR_CPTREQ) != 0U);

    }
    else
    {
      /* Return Function Status */
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  /* Return Function Status */
  return HAL_OK;
}

/**
  * @brief  Resume DCMIPP Pipe capture
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe Pipe to be resumed
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Resume(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (phdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE0)
  {
    /* Check Pipe0 State */
    if (phdcmipp->PipeState[0] == HAL_DCMIPP_PIPE_STATE_SUSPEND)
    {
      /* Enable Capture Request */
      phdcmipp->Instance->P0FCTCR |= DCMIPP_P0FCTCR_CPTREQ;

