zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_dcmipp.c
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Pipe);
  /* Set MultiLine configuration */
  MODIFY_REG(phdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_LINEMULT, Line);

  /* Enable Multiline Interrupt */
  __HAL_DCMIPP_ENABLE_IT(phdcmipp, DCMIPP_IT_PIPE0_LINE);

  return HAL_OK;
}

/**
  * @brief  Disable the the line event interrupt.
  * @param  phdcmipp   pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe pipe where Line event is disabled
  * @retval  HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableLineEvent(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Prevent unused argument(s) compilation warning */
  UNUSED(Pipe);
  /* Enable Multiline Interrupt */
  __HAL_DCMIPP_DISABLE_IT(phdcmipp, DCMIPP_IT_PIPE0_LINE);

  return HAL_OK;
}

/**
  * @}
  */

/** @defgroup DCMIPP_Control_Functions_Group3 Functions
  * @{
  */

/**
  * @brief  Reset the DCMIPP Pipe frame counter
  * @param  Pipe     Pipe selected to reset frame
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ResetFrameCounter(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if (phdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Prevent unused argument(s) compilation warning */
  UNUSED(Pipe);
  /* Check the DCMIPP State */
  if (phdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Clear Frame counter */
    SET_BIT(phdcmipp->Instance->CMCR, DCMIPP_CMCR_CFC);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Read the DCMIPP frame counter
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure
  * @param  Pipe     Pipe selected to read frame counter
  * @param  pCounter pointer to store the value of the frame counter
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ReadFrameCounter(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe, uint32_t *pCounter)
{

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Prevent unused argument(s) compilation warning */
  UNUSED(Pipe);
  /* Check pointer validity */
  if ((phdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the DCMIPP State */
  if (phdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Read frame counter */
    *pCounter = READ_REG(phdcmipp->Instance->CMFRCR);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Read Number of data dumped during the frame for the Pipe0
  * The counter saturates at 0x3FFFFFF. Granularity is 32-bit for all the
  * formats except for the byte stream formats (e.g. JPEG) having byte granularity
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure that contains
  *               the configuration information for the DCMIPP.
  * @param  Pipe     Pipe selected to get data counter
  * @param  pCounter pointer to amount of word transferred
  * @retval Status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetDataCounter(DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe, uint32_t *pCounter)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Prevent unused argument(s) compilation warning */
  UNUSED(Pipe);
  /* Check pointer validity */
  if ((phdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the DCMIPP State */
  if (phdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Read  Pipe0 dump counter register */
    *pCounter = READ_REG(phdcmipp->Instance->P0DCCNTR);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}


/**
  * @}
  */
/** @defgroup DCMIPP_Exported_Functions_Group6 Peripheral State and error functions
  * @{
  */

/**
  * @brief  Return the DCMIPP state
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure that contains
  *               the configuration information for DCMIPP.
  * @retval HAL state
  */
HAL_DCMIPP_StateTypeDef HAL_DCMIPP_GetState(const DCMIPP_HandleTypeDef *phdcmipp)
{
  return phdcmipp->State;
}

/**
  * @brief  Return the DCMIPP error code
  * @param  phdcmipp  pointer to a DCMIPP_HandleTypeDef structure that contains
  *              the configuration information for DCMIPP.
  * @retval DCMIPP Error Code
  */
uint32_t HAL_DCMIPP_GetError(const DCMIPP_HandleTypeDef *phdcmipp)
{
  return phdcmipp->ErrorCode;
}

/**
  * @brief  Return the DCMIPP state
  * @param  phdcmipp pointer to a DCMIPP_HandleTypeDef structure that contains
  *               the configuration information for DCMIPP.
  * @param Pipe Pipe selected to get state
  * @retval HAL state
  */
HAL_DCMIPP_PipeStateTypeDef HAL_DCMIPP_PIPE_GetState(const DCMIPP_HandleTypeDef *phdcmipp, uint32_t Pipe)
{
  /* Check Parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  return phdcmipp->PipeState[Pipe];
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* DCMIPP */
#endif /* HAL_DCMIPP_MODULE_ENABLED */
/**
  * @}
  */

